import {makeObservable, computed, observable, action} from 'mobx';

class Store {
    @observable gallery = [
        {
            id: 0,
            description: "Курсанти ВІТІ навчатимуться за програмами країн НАТО",
            imageUrl: "http://www.viti.edu.ua/img/gallery/1_20.jpg"
        },
        {
            id: 1,
            description: "ВШАНУВАННЯ ПАМ'ЯТІ ГЕРОЇВ-ЗВ'ЯЗКІВЦІВ ",
            imageUrl: "http://www.viti.edu.ua/img/gallery/22bg.jpg  "
        },
        {
            id: 2,
            description: "ВІТІ – це гарант соціального захисту",
            imageUrl: "http://www.viti.edu.ua/img/why/why_42.jpg"
        },
        {
            id: 3,
            description: "Виставка-презентація навчальних закладів «Освіта-2019» у Полтаві",
            imageUrl: "http://www.viti.edu.ua/img/news/1319/1319_1.jpg"
        },
        {
            id: 4,
            description: "Відвідування інституту майбутніми абітурієнтами",
            imageUrl: "http://www.viti.edu.ua/img/news/1316/1316_1.jpg"
        },
        {
            id: 5,
            description: "ДАХК «Артем»",
            imageUrl: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg"
        },
        {
            id: 6,
            description: "Першість інституту з Армспорту",
            imageUrl: "http://www.viti.edu.ua/img/news/1309/1309_1.jpg"
        }
    ];
    @observable news = [
        {
            image: "http://www.viti.edu.ua/img/news/1373/1373_1.jpg",
            id: 0,
            title: "У слухачів «Курсів лідерства тактичної ланки» розпочалася залікова сесія",
            description: "10 майбутніх офіцерів, які навчаються за новою для Збройних Сил України моделлю підготовки військових фахівців тактичного рівня за програмою підготовки “Організація зв’язку у Збройних Силах України”, в період з 16.09.19 по 29.12.19 пройшли навчання з дисциплін блоків загально-професійної та військово-професійної підготовки. По завершенню індивідуальної загальновійськової підготовки слухачі склали диференційні заліки з предметів навчання, по яким кожний отримав оцінку своїх знань та практичних навичок.\n" +
                "\n" +
                "Попереду у слухачів комплексна фахова підготовка та подальше здобуття військового фаху."
        },
        {
            image: "http://www.viti.edu.ua/img/news/1370/1370_1.jpg",
            id: 1,
            title: "Екскурсія до найтаємничнішого місця України – зони Відчуження для офіцерів 5 КППК",
            description: "У рамках культурно-просвітницької програми офіцерів-зв’язківців, які продовжують навчання на 5-тих курсах перепідготовки та підвищення кваліфікації, було організовано екскурсію до найтаємничнішого місця України – зони Відчуження." +
                " Саме там в ніч на 26 квітня 1986 року сталася техногенно- екологічна катастрофа, найбільша за всю історію ядерної енергетики, як за кількістю загиблих і потерпілих від її наслідків людей, так і за завданим нею економічним збитком.Далі офіцери-зв’язківці вирушили у м. Прип’ять, покинуте мешканцями понад чверть століття тому (без відвідувань будівель всередині з міркувань безпеки), де побачили «чортове колесо», дитячий садок і школу, міський басейн р. Прип’ять, стадіон, будівлю міськвиконкому – перший штаб ліквідації наслідків аварії, готель «Полісся»"
        },
        {
            image: "http://www.viti.edu.ua/img/news/1792/1792_1.jpg",
            id: 2,
            title: "Вітаємо із успішним захистом дисертації",
            description: "Колектив Військового інституту телекомунікацій та інформатизації імені Героїв Крут щиро вітає викладача кафедри комп’ютерних інформаційних технологій майора ФЕСЬОХУ Віталія Вікторовича , науковий керівник доктор технічних наук, доцент, працівник Збройних Сил України Субач Ігор Юрійович, з успішним захистом дисертаційної роботи на здобуття наукового ступеня доктора філософії. "
        },
        {
            image: "http://www.viti.edu.ua/img/news/922/922_1.jpg",
            id: 3, title: "Війська зв’язку Збройних Сил України поповнили молодші лейтенанти",
            description: "У Військовому інституті телекомунікацій та інформатизації відбувся урочистий випуск сержантського та старшинського складу військової служби за контрактом, які мають вищу освіту.\n" +
                "\n" +
                "Після оголошення наказу про присвоєння первинного військового звання «молодший лейтенант», випускникам було вручено відповідні посвідчення та офіцерські погони.\n" +
                "\n" +
                "Подібні курси дають можливість поповнити офіцерський склад військ зв′язку Збройних Сил України молодим поколінням спеціалістів, яке прагне продовжити традиції захисників рідної землі."
        },
        {
            image: "http://www.viti.edu.ua/img/news/916/916_1.jpg",
            id: 4, title: "Курсанти ВІТІ імені Героїв Крут приєдналися до великої родини українських донорів",
            description: "Сьогодні, 27.12.2018, курсанти Військового інституту телекомунікацій та інформатизації імені Героїв Крут мали змогу приєднатися до великої родини українських донорів. Вони здавали кров для дорослих та дітей, яким неабияк потрібна допомога. Донорство є корисним не лише для того, кому дають кров, але й для того хто її здає.\n" +
                "\n" +
                "Хоча даний вид волонтерства не є досить популярним в Україні, але курсанти нашого інституту вважають за свій обов’язок допомагати людям, які цього потребують.\n" +
                "\n" +
                "Курсанти інституту закликають усіх: Здавайте кров і рятуйте життя разом з нами!"
        },
        {
            image: "http://www.viti.edu.ua/img/news/1781/1781_1.jpg",
            id: 5, title: "Курсанти ВІТІ вчать суспільство медіаграмотності ",
            description: " Російська Федерація веде інформаційну війну проти України. Дезінформація в ЗМІ, інтернет-блогах та телебаченні призводить до дестабілізації політичної ситуації у державі, на міжнародному ринку та демонструє нагальну потребу розробки програмного рішення, функціональні можливості якого забезпечуватимуть фільтрацію інформації це і намагаються виправити амбітні курсанти – зв’язківці створюючи «OFFake»."
        },
        {
            image: "http://www.viti.edu.ua/img/news/912/912_1.jpg",
            id: 6, title: "Презентація книги «Бермудський трикутник» випускника інституту",
            description: "У «Бермудському трикутнику» описані події, що відбувались у 1983-1985 роках у Демократичній Республіці Афганістан. До оголошення незалежності України автор не міг опублікувати те, що збирав роками, адже заборона поширювалась на розповсюдження будь-якої інформації, а тим паче правдивої. Майже 30 років полковник Жданов не міг висвітлити правду проходження ним військової служби в Афганістані."
        },
        /*{
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 7, title: "ДП ВО «Південний машинобудівний завод ім. О.М. Макарова»",
            description: "ДП ВО «Південний машинобудівний завод ім. О.М. Макарова» на власному стенді ознайомило усіх зацікавлених з наступними експонатами: рідинний ракетний двигун РД-843 «Вега»; камера згоряння рідинного ракетного двигуна РД‑8 другого ступеня ракети‑носія «Зеніт‑2» після вогневих випробувань; макет агрегатів шасі літаків Ан-140/148; макети сильфона та кулебалона."
        },
        {
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 8, title: "АТ «Мотор Січ» та ДП «Івченко Прогрес»",
            description: "На спільній експозиції АТ «Мотор Січ» та ДП «Івченко Прогрес» показали сучасні авіаційні двигуни АІ‑322Ф, Д‑436‑148ФМ, ТВ3‑117ВМА‑СБМ1В серії 4Е, МС‑500В‑02С, повітряний гвинт MTV‑27, МС‑450. В свою чергу хочемо нагадати, що нещодавно в Туреччині БПЛА Akinci, розроблений компанією Bayraktar та оснащений двигуном виробництва ДП «Івченко Прогрес», встановив новий рекорд, досягши найбільшої висоти, яку коли‑небудь досягали БПЛА турецького виробництва."
        },
        {
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 9, title: "Приватне акціонерне товариство «Рамзай»",
            description: "Приватне акціонерне товариство «Рамзай», що інтегрувало до своїх потужностей команду НТК «Горизонт» з їхнім проектом легкого багатоцільового вертольоту, представило модифіковану версію SL‑231 Scout. Це трьохмісний вертоліт, кабіна якого виконана з композитну і обладнана авіонікою словенської компанії Knardia (в одній з версій).\n" +
                "\n" +
                "Окрім цього, Scout може оснащуватись авіаційними бортовими системами компаній Dynon SkyView, Advanced Flight Systems, MGL. На вертоліт встановлено авіаційний двигун американської компанії Lycoming IO‑390 на 210 к.с. Вага порожнього вертольоту становить 450 кг. Максимальне корисне навантаження до 400 кг. Дальність польоту до 600 км. Крейсерська швидкість польоту близько 190 км/год."
        },
        {
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 10,
            title: "Підписання ДК «Укрспецекспорт», що входить до складу ДК «Укроборонпром», контракту на модернізацію та ремонт літака Військово-повітряних сил (ВПС) Пакистану.",
            description: "Під час другого дня роботи виставки укладено контракт з пакистанськими партнерами на ремонт літака-заправника Іл‑78, що може використовуватись як військово-транспортний літак та призначений для дозаправлення у повітрі військових повітряних суден.\n" +
                "«За останній рік це вже другий укладений контракт на ремонт Іл‑78 для ВПС Пакистану. У червні 2020 року Укрспецекспорт переміг у тамтешньому багатомільйонному тендері на ремонт літака-заправника. За його результатами ДК «Укрспецекспорт» уклала з Управлінням закупівель Військово-повітряних сил Пакистану контракт на ремонт військових літаків. Контракт успішно виконав Миколаївський авіаремонтний завод, що входить до складу Концерну», – зазначає Генеральний директор державної компанії «Укрспецекспорт» Вадим Ноздря."
        },
        {
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 11,
            title: "Зустріч керівництва ДК «Укроборонпром» з французькою делегацією під час заходу «Французькі дні охорони та безпеки в Україні», який був організований Посольством Франції в Україні.",
            description: "Під час заходу було обговорено можливість та перспективи укладення контрактів з тамтешніми компаніями Thales, Safran та Airbus в рамках вже підписаних меморандумів про співробітництво. Зокрема, йшлося про проекти у сферах авіабудування, бронетехніки та радіолокаційних систем."
        },
        {
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 12,
            title: "Національна асоціація оборонної промисловості України (NAUDI) та асоціація приватних оборонних підприємств Індонезії уклали угоду про співробітництво у сфері ВПК.",
            description: "Підписантами виступили Голова NAUDI Андрій Сенченко та фінансовий директор Асоціації приватних оборонних підприємств Індонезії Хендра Гуванан.\n" +
                "Сторони домовилися, зокрема сприяти розвитку кооперації шляхом підбору партнерів та інтеграторів, реалізації партнерських проектів, зміцнення кадрового і виробничого потенціалу оборонних галузей, трансферу технологій тощо. Термін чинності угоди – 10 років з можливістю пролонгації. Угода про співпрацю з індонезійськими колегами – перший крок NAUDI на шляху до реалізації завдання з просування української військової техніки, озброєння та боєприпасів на зовнішніх ринках."
        },
        {
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 13, title: "Підписання Меморандуму про співпрацю між NAUDI та тбіліським авіаційним заводом.",
            description: "Меморандумом закріплені наміри сторін співпрацювати у сфері безпеки та оборони задля поліпшення взаємної здатності розвивати сильну і незалежну оборонну індустрію.\n" +
                "Сторони розвиватимуть спільні проекти, в широкому спектрі оборонних напрямків, зокрема постачанні продукції для потреб військових і силових відомств України та Грузії та третіх сторін, проведенні науково-дослідних та дослідно-конструкторських робіт, організації програм навчання військовослужбовців, розвитку ланцюгів попиту і пропозиції, інтенсифікації маркетингових активностей."
        },
        {
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 14,
            title: "Зустріч командування Національної гвардії України та командувача Генерального Інспекторату Карабінерів Молдови.",
            description: "У період відвідування виставки іноземною делегацією з Молдови були проведені переговори з командуванням Національної гвардії України, під час якої сторони досягли порозуміння щодо необхідності започаткувати співробітництво в рамках Меморандуму про взаєморозуміння між Генеральним Інспекторатом Карабінерів Міністерства внутрішніх справ Республіки Молдова та Національною гвардією України, який наразі перебуває в процесі погодження."
        }*/
    ];

    @computed get getAllImages() {
        return this.gallery;
    }

    @computed get getAllNews() {
        return this.news;
    }

    // @action.bound
    // doneTask(id){
    //     const tasks = this.tasks;
    //     const index = tasks.map(task => task.id).indexOf(id);
    //     tasks[index].done = true;
    //     this.setTasks(tasks)
    // }

    constructor() {
        makeObservable(this);
    }
}

export default Store;