import { makeObservable, computed, observable, action } from 'mobx';

class Store{
    @observable gallery = [
        {id: 0, description: "АВІАСВІТ-ХХІ", imageUrl: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj012021_800x800-equal.jpg"},
        {id: 1, description: "Пожмашина ", imageUrl: "https://www.iec-expo.com.ua/cache/images/fotovistavki/tehnologiizaschiti/2021/photo/otchet/tzotchet0121_800x800-equal.jpg"},
        {id: 2, description: "Авіакомпанія «Українські вертольоти»", imageUrl: "https://www.iec-expo.com.ua/cache/images/fotovistavki/tehnologiizaschiti/2021/photo/otchet/tzotchet00421_800x800-equal.jpg"},
        {id: 3, description: "Харківського заводу імені В.О. Малишева", imageUrl: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj012021_800x800-equal.jpg"},
        {id: 4, description: "ДККБ «Луч»", imageUrl: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj022021_800x800-equal.jpg"},
        {id: 5, description: "ДАХК «Артем»", imageUrl: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg"},
        {id: 6, description: "Міністерство економічного розвитку, праці та технологій Республіки Польща представило Національну експозицію підприємств авіаційної галузі", imageUrl: "https://www.iec-expo.com.ua/cache/images/fotovistavki/avia/2021/otchet2021/ftav2103_800x800-equal.jpg"},
        {id: 7, description: "ДП КБ «Південне»", imageUrl: "https://www.iec-expo.com.ua/cache/images/fotovistavki/avia/2021/otchet2021/ftav2107_800x800-equal.jpg"},
        {id: 8, description: "Проект EOSSAR, Space Electric Thruster Systems, Flight Control", imageUrl: "https://www.iec-expo.com.ua/cache/images/fotovistavki/avia/2021/otchet2021/ftav2109_800x800-equal.jpg"}
    ];
    @observable news = [
        {id: 0,
            title: "ЗВІТ ЗА РЕЗУЛЬТАТАМИ ПРОВЕДЕННЯ\n" +
                "XІІ МІЖНАРОДНОГО АВІАКОСМІЧНОГО САЛОНУ\n" +
                "АВІАСВІТ-ХХІ",
            description: "З 15 по 18 червня 2021 р. на території Міжнародного виставкового центру відбувся єдиний вітчизняний виставковий захід у сфері авіапромисловості і космічних технологій – ХІІ Міжнародний авіакосмічний салон «АВІАСВІТ - ХХІ».\n" +
                "\n" +
                "Вже вчетверте Салон проведений в єдиному форматі з Міжнародною спеціалізованою виставкою «Зброя та безпека». Цього разу презентація досягнень вітчизняної авіакосмічної та оборонної галузі була присвячена 30‑річчю незалежності України."},
        {id: 1, title: "XVII МІЖНАРОДНОЇ СПЕЦІАЛІЗОВАНОЇ ВИСТАВКИ\n" +
                "ЗБРОЯ ТА БЕЗПЕКА – 2021", description: "З 15 по 18 червня 2021 р. на території Міжнародного виставкового центру відбулась XVІІ Міжнародна спеціалізована виставка «Зброя та безпека ‑ 2021».\n" +
                "\n" +
                "Незважаючи на складнощі, пов'язані із пандемією COVID‑19, цьогорічна виставка підтвердила статус вагомого заходу відповідного спрямування у Східній Європі за кількістю учасників, представлених зразків техніки та новинок, а також за представницьким рівнем та популярністю серед громадськості. Результати проведення продемонстрували, що тривале очікування виставки дало можливість добре підготуватися до неї не тільки постійним учасникам, а й дебютантам, які у ці непрості часи зробили великі ставки саме на участь у виставці."},
        {id: 2, title: "ПРОВЕДЕННЯ\n" +
                "XІX МІЖНАРОДНОЇ СПЕЦІАЛІЗОВАНОЇ ВИСТАВКИ\n" +
                "ПОЖЕЖНО‑РЯТУВАЛЬНОГО ОБЛАДНАННЯ\n" +
                "ТЕХНОЛОГІЇ ЗАХИСТУ/ПОЖТЕХ‑2021", description: "З 15 по 18 червня 2021 року на території Міжнародного виставкового центру відбулася провідна подія для України у сфері пожежно‑рятувального обладнання - XIX Міжнародна спеціалізована виставка «Технології захисту/ПожТех‑2021».\n" +
                "\n" +
                "Захід вже традиційно було проведено в єдиному форматі з ІІ Міжнародною спеціалізованою виставкою систем безпеки та охорони «Expert Security‑2021», XVІI Міжнародною спеціалізованою виставкою у сфері ОПК «Зброя та безпека‑2021» та ХII Міжнародним авіакосмічним салоном «Авіасвіт‑ХХІ»."},
        {id: 3, title: "Міністерство економічного розвитку, праці та технологій Республіки Польща",
            description: "представило Національну експозицію підприємств авіаційної галузі. Понад 10 польських фірм, експонентів та учасників економічної місії презентували свій експортний потенціал під час авіакосмічного салону у Києві. За участі Польсько‑Української Господарчої Палати та Polish Business Center в Україні був проведений прес‑брифінг, під час якого було організовано бізнес‑зустрічі українських потенційних партнерів з представниками польських фірм, котрі зацікавлені у налагоджуванні довгострокової співпраці."},
        {id: 4, title: "Dassault Systèmes S.A. (Франція) та Softprom (Австрія) ",
            description: "Компанії Dassault Systèmes S.A. (Франція) та Softprom (Австрія) представили єдине віртуальне середовище 3DEXPERIENCE для розробки, виробництва, випробування, сертифікації і обслуговування повітряних суден і космічних апаратів. Dassault Systèmes є однією з провідних світових компаній в галузі програмного забезпечення САПР і PLM."},
        {id: 5, title: "КП СПБ «Арсенал»",
            description: " СПБ «Арсенал» продемонструвало продукцію одразу з декількох напрямків:\n" +
                "- космос – це і зоряні датчики, і системи дистанційного зондування – ті, що вже літали і полетять на СІЧ‑2‑30.\n" +
                "- продукція військового призначення – це лазерні гіроскопи всіх типів, інфрачервоні головки самонаведення як для авіаційних засобів ураження, так і для ракет протиповітряної оборони – зокрема, у сфері переносних зенітно-ракетних комплексів."},
        {id: 6, title: "ДП КБ «Південне»",
            description: "ДП КБ «Південне» представило:\n" +
                "- модель місячного лендер-хоппера;\n" +
                "- моделі РН «Антарес» та «Циклон‑4М»;\n" +
                "- габаритно‑динамічний макет КА «Мікросат‑Іоносат».\n" +
                "\n" +
                "Особливу увагу відвідувачів виставки привернула віртуальна прогулянка Місячною промислово‑дослідною базою КБ «Південне»."},
        {id: 7, title: "ДП ВО «Південний машинобудівний завод ім. О.М. Макарова»",
            description: "ДП ВО «Південний машинобудівний завод ім. О.М. Макарова» на власному стенді ознайомило усіх зацікавлених з наступними експонатами: рідинний ракетний двигун РД-843 «Вега»; камера згоряння рідинного ракетного двигуна РД‑8 другого ступеня ракети‑носія «Зеніт‑2» після вогневих випробувань; макет агрегатів шасі літаків Ан-140/148; макети сильфона та кулебалона."},
        {id: 8, title: "АТ «Мотор Січ» та ДП «Івченко Прогрес»",
            description: "На спільній експозиції АТ «Мотор Січ» та ДП «Івченко Прогрес» показали сучасні авіаційні двигуни АІ‑322Ф, Д‑436‑148ФМ, ТВ3‑117ВМА‑СБМ1В серії 4Е, МС‑500В‑02С, повітряний гвинт MTV‑27, МС‑450. В свою чергу хочемо нагадати, що нещодавно в Туреччині БПЛА Akinci, розроблений компанією Bayraktar та оснащений двигуном виробництва ДП «Івченко Прогрес», встановив новий рекорд, досягши найбільшої висоти, яку коли‑небудь досягали БПЛА турецького виробництва."},
        {id: 9, title: "Приватне акціонерне товариство «Рамзай»",
            description: "Приватне акціонерне товариство «Рамзай», що інтегрувало до своїх потужностей команду НТК «Горизонт» з їхнім проектом легкого багатоцільового вертольоту, представило модифіковану версію SL‑231 Scout. Це трьохмісний вертоліт, кабіна якого виконана з композитну і обладнана авіонікою словенської компанії Knardia (в одній з версій).\n" +
                "\n" +
                "Окрім цього, Scout може оснащуватись авіаційними бортовими системами компаній Dynon SkyView, Advanced Flight Systems, MGL. На вертоліт встановлено авіаційний двигун американської компанії Lycoming IO‑390 на 210 к.с. Вага порожнього вертольоту становить 450 кг. Максимальне корисне навантаження до 400 кг. Дальність польоту до 600 км. Крейсерська швидкість польоту близько 190 км/год."},
        {id: 10, title: "Підписання ДК «Укрспецекспорт», що входить до складу ДК «Укроборонпром», контракту на модернізацію та ремонт літака Військово-повітряних сил (ВПС) Пакистану.",
            description: "Під час другого дня роботи виставки укладено контракт з пакистанськими партнерами на ремонт літака-заправника Іл‑78, що може використовуватись як військово-транспортний літак та призначений для дозаправлення у повітрі військових повітряних суден.\n" +
                "«За останній рік це вже другий укладений контракт на ремонт Іл‑78 для ВПС Пакистану. У червні 2020 року Укрспецекспорт переміг у тамтешньому багатомільйонному тендері на ремонт літака-заправника. За його результатами ДК «Укрспецекспорт» уклала з Управлінням закупівель Військово-повітряних сил Пакистану контракт на ремонт військових літаків. Контракт успішно виконав Миколаївський авіаремонтний завод, що входить до складу Концерну», – зазначає Генеральний директор державної компанії «Укрспецекспорт» Вадим Ноздря."},
        {id: 11, title: "Зустріч керівництва ДК «Укроборонпром» з французькою делегацією під час заходу «Французькі дні охорони та безпеки в Україні», який був організований Посольством Франції в Україні.",
            description: "Під час заходу було обговорено можливість та перспективи укладення контрактів з тамтешніми компаніями Thales, Safran та Airbus в рамках вже підписаних меморандумів про співробітництво. Зокрема, йшлося про проекти у сферах авіабудування, бронетехніки та радіолокаційних систем."},
        {id: 12, title: "Національна асоціація оборонної промисловості України (NAUDI) та асоціація приватних оборонних підприємств Індонезії уклали угоду про співробітництво у сфері ВПК.",
            description: "Підписантами виступили Голова NAUDI Андрій Сенченко та фінансовий директор Асоціації приватних оборонних підприємств Індонезії Хендра Гуванан.\n" +
                "Сторони домовилися, зокрема сприяти розвитку кооперації шляхом підбору партнерів та інтеграторів, реалізації партнерських проектів, зміцнення кадрового і виробничого потенціалу оборонних галузей, трансферу технологій тощо. Термін чинності угоди – 10 років з можливістю пролонгації. Угода про співпрацю з індонезійськими колегами – перший крок NAUDI на шляху до реалізації завдання з просування української військової техніки, озброєння та боєприпасів на зовнішніх ринках."},
        {id: 13, title: "Підписання Меморандуму про співпрацю між NAUDI та тбіліським авіаційним заводом.",
            description: "Меморандумом закріплені наміри сторін співпрацювати у сфері безпеки та оборони задля поліпшення взаємної здатності розвивати сильну і незалежну оборонну індустрію.\n" +
                "Сторони розвиватимуть спільні проекти, в широкому спектрі оборонних напрямків, зокрема постачанні продукції для потреб військових і силових відомств України та Грузії та третіх сторін, проведенні науково-дослідних та дослідно-конструкторських робіт, організації програм навчання військовослужбовців, розвитку ланцюгів попиту і пропозиції, інтенсифікації маркетингових активностей."},
        {id: 14, title: "Зустріч командування Національної гвардії України та командувача Генерального Інспекторату Карабінерів Молдови.",
            description: "У період відвідування виставки іноземною делегацією з Молдови були проведені переговори з командуванням Національної гвардії України, під час якої сторони досягли порозуміння щодо необхідності започаткувати співробітництво в рамках Меморандуму про взаєморозуміння між Генеральним Інспекторатом Карабінерів Міністерства внутрішніх справ Республіки Молдова та Національною гвардією України, який наразі перебуває в процесі погодження."}
    ];
    @computed get getAllImages(){
        return this.gallery;
    }

    @computed get getAllNews(){
        return this.news;
    }

    // @action.bound
    // doneTask(id){
    //     const tasks = this.tasks;
    //     const index = tasks.map(task => task.id).indexOf(id);
    //     tasks[index].done = true;
    //     this.setTasks(tasks)
    // }

    constructor(){
        makeObservable(this);
    }
}

export default Store;