import React from "react";
import {Container} from 'react-bootstrap';

function AboutPage() {
    return (
        <Container>
            <h1 className="mb-4">Про сайт</h1>
            <p>У військовому інституті створено всі необхідні умови для здійснення навчально-виховного процесу згідно
                потреб сучасності: 110 лекційних, навчальних, лабораторних, спеціалізованих аудиторій, комп’ютерних
                лабораторій, та інших класів; навчально-тренувальний комплекс для відпрацювання питань практичної
                підготовки курсантів на засобах зв'язку і АСУ; стрілецький тир; 4 спортивні та тренажерні зали; 2
                спортивних майданчики, спортивне містечко для занять силовими вправами; смуга перешкод.
            </p>
            <p>Випускники інституту отримують диплом державного зразка та первинне офіцерське звання лейтенант. Офіцери
                випускники направляються для подальшого проходження військової служби до частин та підрозділів Збройних
                Сил України та інших військових формувань держави.</p>
            <p>
                Випускники Військового коледжу сержантського складу отримують диплом молодшого спеціаліста державного
                зразка та звання сержанта. Випускники направляються для подальшого проходження військової служби до
                частин та підрозділів Збройних Сил України та інших військових формувань держави, а також можуть
                продовжити навчання у Військовому інституті за спорідненими спеціальностями для отримання вищих ступенів
                освіти та військового звання лейтенант.
            </p>
            <p>
                На науковий центр зв’язку та інформатизації покладаються завдання щодо планування, організації і
                безпосереднього здійснення всіх видів і форм наукової та науково-технічної діяльності з проблем воєнної
                науки на замовлення (за договорами, оперативними завданнями) органам державної виконавчої влади,
                структурних підрозділів центрального апарату Міністерства оборони України, Генерального штабу Збройних
                Сил України і видів Збройних Сил України, органів місцевого самоврядування, підприємств, установ і
                організацій. Основним напрямом діяльності НЦЗІ ВІТІ є виконання НДДКР, відпрацювання оперативних
                постановок, наукове супроводження та впровадження результатів дослідно-конструкторських робіт.
            </p>
            <p>
                5-ті Курси перепідготовки та підвищення кваліфікації дислокуються на території Військового інституту
                телекомунікацій та інформатизації та є окремою військовою частиною польова пошта В0805, яка
                підпорядковується начальнику інституту. Навчання на курсах проводяться, як теоретично в навчальних
                аудиторіях на кафедрах інституту, де вивчаються новітні засоби зв’язку, так і в польових умовах. Слухачі
                курсів під керівництвом офіцерів, які неодноразово перебували на Сході України, приймали участь в АТО,
                опановують організацію життєдіяльності у польових умовах та відпрацьовують нормативи по роботі на
                військовій техніці зв’язку, нормативи з вогневої та інженерної підготовки.
            </p>
        </Container>
    )
}

export default AboutPage;