import React from "react";
import {Container} from 'react-bootstrap';

function AboutPage (){
    return(
        <Container>
            <h1>Про сайт</h1>
            <p>Пресслужба виставки «Авіасвіт XXI» отримала листа від Мінстратегпрому де вказано, що Міністерство з питань стратегічних галузей промисловості України обʼєднало виставкові заходи «Авіасвіт XXI», «Зброя та Безпека», «Експерт Сек’юріті», «Технології захисту/ПожТех», а також Міжнародний оборонний інвестиційний форум України під одним заходом, який отримав назву «Міжнародна оборонна виставка України».
            </p>
            <p></p>
        </Container>
    )
}
export default AboutPage;